; ModuleID = '/Users/Jonas/CDot/StdLib/builtin/mod.dotm'
source_filename = "/Users/Jonas/CDot/StdLib/builtin/mod.dotm"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin18.0.0"

%"struct.builtin.<private name>.TypeInfo" = type <{ %"struct.builtin.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.builtin.<private name>.ValueWitnessTable"*, %"struct.builtin.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.builtin.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.builtin.<private name>.ProtocolConformance" = type <{ %"struct.builtin.<private name>.TypeInfo"*, i8** }>
%"struct.builtin.<private name>.Int64" = type <{ i64 }>
%"struct.builtin.<private name>.Bool" = type <{ i1 }>
%"struct.builtin.<private name>.ExistentialContainer" = type <{ i8*, %"struct.builtin.<private name>.TypeInfo"*, %"struct.builtin.<private name>.ProtocolConformance"* }>


!2710 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_i16EsL0", linkageName: "_CNW7builtinE9bswap_i16EsL0", scope: null, file: !6, line: 87, type: !1417, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2711 = !DILocalVariable(name: "val", scope: !2710, file: !1, line: 87, type: !69)
!2712 = !DILocation(line: 87, column: 4546, scope: !2710)
!2713 = !DILocation(line: 87, column: 4603, scope: !2710)
!2714 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_i32EiL0", linkageName: "_CNW7builtinE9bswap_i32EiL0", scope: null, file: !6, line: 87, type: !1439, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2715 = !DILocalVariable(name: "val", scope: !2714, file: !1, line: 87, type: !101)
!2716 = !DILocation(line: 87, column: 4546, scope: !2714)
!2717 = !DILocation(line: 87, column: 4603, scope: !2714)
!2718 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_i64ElL0", linkageName: "_CNW7builtinE9bswap_i64ElL0", scope: null, file: !6, line: 87, type: !1461, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2719 = !DILocalVariable(name: "val", scope: !2718, file: !1, line: 87, type: !133)
!2720 = !DILocation(line: 87, column: 4546, scope: !2718)
!2721 = !DILocation(line: 87, column: 4603, scope: !2718)
!2722 = distinct !DISubprogram(name: "_CNW7builtinE10bswap_i128EnL0", linkageName: "_CNW7builtinE10bswap_i128EnL0", scope: null, file: !6, line: 87, type: !1483, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2723 = !DILocalVariable(name: "val", scope: !2722, file: !1, line: 87, type: !165)
!2724 = !DILocation(line: 87, column: 4546, scope: !2722)
!2725 = !DILocation(line: 87, column: 4603, scope: !2722)
!2726 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_u16EtL0", linkageName: "_CNW7builtinE9bswap_u16EtL0", scope: null, file: !6, line: 87, type: !1428, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2727 = !DILocalVariable(name: "val", scope: !2726, file: !1, line: 87, type: !85)
!2728 = !DILocation(line: 87, column: 4546, scope: !2726)
!2729 = !DILocation(line: 87, column: 4603, scope: !2726)
!2730 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_u32EjL0", linkageName: "_CNW7builtinE9bswap_u32EjL0", scope: null, file: !6, line: 87, type: !1450, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2731 = !DILocalVariable(name: "val", scope: !2730, file: !1, line: 87, type: !117)
!2732 = !DILocation(line: 87, column: 4546, scope: !2730)
!2733 = !DILocation(line: 87, column: 4603, scope: !2730)
!2734 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_u64EmL0", linkageName: "_CNW7builtinE9bswap_u64EmL0", scope: null, file: !6, line: 87, type: !1472, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2735 = !DILocalVariable(name: "val", scope: !2734, file: !1, line: 87, type: !149)
!2736 = !DILocation(line: 87, column: 4546, scope: !2734)
!2737 = !DILocation(line: 87, column: 4603, scope: !2734)
!2738 = distinct !DISubprogram(name: "_CNW7builtinE10bswap_u128EoL0", linkageName: "_CNW7builtinE10bswap_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2739 = !DILocalVariable(name: "val", scope: !2738, file: !1, line: 87, type: !181)
!2740 = !DILocation(line: 87, column: 4546, scope: !2738)
!2741 = !DILocation(line: 87, column: 4603, scope: !2738)
!2742 = distinct !DISubprogram(name: "_CNW7builtinE4Bool4copyES0_L0", linkageName: "_CNW7builtinE4Bool4copyES0_L0", scope: !0, file: !1913, line: 2, type: !1926, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2743 = !DILocation(line: 2, column: 1, scope: !2742)
!2744 = distinct !DISubprogram(name: "_CNW7builtinE4Bool14__default_initES0_L0", linkageName: "_CNW7builtinE4Bool14__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !1926, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2745 = !DILocation(line: 2, column: 1, scope: !2744)
!2746 = distinct !DISubprogram(name: "_CNW7builtinE4BoolC1EbL5value", linkageName: "_CNW7builtinE4BoolC1EbL5value", scope: !0, file: !1913, line: 2, type: !2747, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2747 = !DISubroutineType(types: !2748)
!2748 = !{!1936, !1597}
!2749 = !DILocation(line: 2, column: 1, scope: !2746)
!2750 = distinct !DISubprogram(name: "_CNW7builtinE4BoolC2ERS0_bL0L5value", linkageName: "_CNW7builtinE4BoolC2ERS0_bL0L5value", scope: !0, file: !1913, line: 2, type: !2747, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2751 = !DILocation(line: 2, column: 1, scope: !2750)
!2752 = distinct !DISubprogram(name: "_CNW7builtinE4BoolD3Ev", linkageName: "_CNW7builtinE4BoolD3Ev", scope: null, file: !1913, line: 2, type: !1934, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2753 = !DILocation(line: 2, column: 1, scope: !2752)
!2754 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableD0Ev", linkageName: "_CNW7builtinE17ValueWitnessTableD0Ev", scope: !0, file: !1913, line: 2, type: !2755, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2755 = !DISubroutineType(types: !2756)
!2756 = !{!2757}
!2757 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2758, size: 64, align: 8)
!2758 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ValueWitnessTable", file: !1913, line: 2, flags: DIFlagFwdDecl, elements: !2759)
!2759 = !{!2760, !2762}
!2760 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !2758, file: !1913, line: 2, baseType: !2761, size: 64, align: 64)
!2761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 8)
!2762 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !2758, file: !1913, line: 2, baseType: !2763, size: 64, align: 64, offset: 64)
!2763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64, align: 8)
!2764 = !DILocation(line: 2, column: 1, scope: !2754)
!2765 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW7builtinE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !2766, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2766 = !DISubroutineType(types: !2767)
!2767 = !{!2758}
!2768 = !DILocation(line: 2, column: 1, scope: !2765)
!2769 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW7builtinE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !1913, line: 2, type: !2770, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2770 = !DISubroutineType(types: !2771)
!2771 = !{!2757, !2761, !2763}
!2772 = !DILocation(line: 2, column: 1, scope: !2769)
!2773 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", linkageName: "_CNW7builtinE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", scope: !0, file: !1913, line: 2, type: !2770, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2774 = !DILocation(line: 2, column: 1, scope: !2773)
!2775 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableD3Ev", linkageName: "_CNW7builtinE17ValueWitnessTableD3Ev", scope: null, file: !1913, line: 2, type: !2755, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2776 = !DILocation(line: 2, column: 1, scope: !2775)
!2777 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceD0Ev", linkageName: "_CNW7builtinE19ProtocolConformanceD0Ev", scope: !0, file: !1913, line: 2, type: !2778, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2778 = !DISubroutineType(types: !2779)
!2779 = !{!2780}
!2780 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2781, size: 64, align: 8)
!2781 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ProtocolConformance", file: !1913, line: 2, flags: DIFlagFwdDecl, elements: !2782)
!2782 = !{!2783, !2800}
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !2781, file: !1913, line: 2, baseType: !2784, size: 64, align: 64)
!2784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2785, size: 64, align: 8)
!2785 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.TypeInfo", file: !1913, line: 2, flags: DIFlagFwdDecl, elements: !2786)
!2786 = !{!2787, !2788, !2790, !2791, !2793, !2795, !2797, !2798, !2799}
!2787 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !2785, file: !1913, line: 2, baseType: !2784, size: 64, align: 64)
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2785, file: !1913, line: 2, baseType: !2789, size: 64, align: 64, offset: 64)
!2789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 8)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !2785, file: !1913, line: 2, baseType: !2763, size: 64, align: 64, offset: 128)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2785, file: !1913, line: 2, baseType: !2792, size: 64, align: 64, offset: 192)
!2792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 8)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !2785, file: !1913, line: 2, baseType: !2794, size: 64, align: 64, offset: 256)
!2794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2758, size: 64, align: 8)
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !2785, file: !1913, line: 2, baseType: !2796, size: 64, align: 64, offset: 320)
!2796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2781, size: 64, align: 8)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2785, file: !1913, line: 2, baseType: !149, size: 64, align: 64, offset: 384)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2785, file: !1913, line: 2, baseType: !149, size: 64, align: 64, offset: 448)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !2785, file: !1913, line: 2, baseType: !149, size: 64, align: 64, offset: 512)
!2800 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2781, file: !1913, line: 2, baseType: !2789, size: 64, align: 64, offset: 64)
!2801 = !DILocation(line: 2, column: 1, scope: !2777)
!2802 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW7builtinE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !2803, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2803 = !DISubroutineType(types: !2804)
!2804 = !{!2781}
!2805 = !DILocation(line: 2, column: 1, scope: !2802)
!2806 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW7builtinE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !1913, line: 2, type: !2807, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2807 = !DISubroutineType(types: !2808)
!2808 = !{!2780, !2784, !2789}
!2809 = !DILocation(line: 2, column: 1, scope: !2806)
!2810 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW7builtinE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !1913, line: 2, type: !2807, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2811 = !DILocation(line: 2, column: 1, scope: !2810)
!2812 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceD3Ev", linkageName: "_CNW7builtinE19ProtocolConformanceD3Ev", scope: null, file: !1913, line: 2, type: !2778, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2813 = !DILocation(line: 2, column: 1, scope: !2812)
!2814 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoD0Ev", linkageName: "_CNW7builtinE8TypeInfoD0Ev", scope: !0, file: !1913, line: 2, type: !2815, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2815 = !DISubroutineType(types: !2816)
!2816 = !{!2817}
!2817 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2785, size: 64, align: 8)
!2818 = !DILocation(line: 2, column: 1, scope: !2814)
!2819 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfo14__default_initES0_L0", linkageName: "_CNW7builtinE8TypeInfo14__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !2820, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2820 = !DISubroutineType(types: !2821)
!2821 = !{!2785}
!2822 = !DILocation(line: 2, column: 1, scope: !2819)
!2823 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW7builtinE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !1913, line: 2, type: !2824, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2824 = !DISubroutineType(types: !2825)
!2825 = !{!2817, !2784, !2789, !2763, !2792, !2794, !2796, !149, !149, !149}
!2826 = !DILocation(line: 2, column: 1, scope: !2823)
!2827 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW7builtinE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !1913, line: 2, type: !2824, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2828 = !DILocation(line: 2, column: 1, scope: !2827)
!2829 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoD3Ev", linkageName: "_CNW7builtinE8TypeInfoD3Ev", scope: null, file: !1913, line: 2, type: !2815, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2830 = !DILocation(line: 2, column: 1, scope: !2829)
!2831 = distinct !DISubprogram(name: "_CNW7builtinE5Int64D0Ev", linkageName: "_CNW7builtinE5Int64D0Ev", scope: !0, file: !1913, line: 2, type: !2832, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2832 = !DISubroutineType(types: !2833)
!2833 = !{!2834}
!2834 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2835, size: 64, align: 8)
!2835 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.Int64", file: !1913, line: 2, flags: DIFlagFwdDecl, elements: !2836)
!2836 = !{!2837}
!2837 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2835, file: !1913, line: 2, baseType: !133, size: 64, align: 64)
!2838 = !DILocation(line: 2, column: 1, scope: !2831)
!2839 = distinct !DISubprogram(name: "_CNW7builtinE5Int644copyES0_L0", linkageName: "_CNW7builtinE5Int644copyES0_L0", scope: !0, file: !1913, line: 2, type: !2840, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2840 = !DISubroutineType(types: !2841)
!2841 = !{!2835}
!2842 = !DILocation(line: 2, column: 1, scope: !2839)
!2843 = distinct !DISubprogram(name: "_CNW7builtinE5Int6414__default_initES0_L0", linkageName: "_CNW7builtinE5Int6414__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !2840, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2844 = !DILocation(line: 2, column: 1, scope: !2843)
!2845 = distinct !DISubprogram(name: "_CNW7builtinE5Int64C1ElL5value", linkageName: "_CNW7builtinE5Int64C1ElL5value", scope: !0, file: !1913, line: 2, type: !2846, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2846 = !DISubroutineType(types: !2847)
!2847 = !{!2834, !133}
!2848 = !DILocation(line: 2, column: 1, scope: !2845)
!2849 = distinct !DISubprogram(name: "_CNW7builtinE5Int64C2ERS0_lL0L5value", linkageName: "_CNW7builtinE5Int64C2ERS0_lL0L5value", scope: !0, file: !1913, line: 2, type: !2846, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2850 = !DILocation(line: 2, column: 1, scope: !2849)
!2851 = distinct !DISubprogram(name: "_CNW7builtinE5Int64D3Ev", linkageName: "_CNW7builtinE5Int64D3Ev", scope: null, file: !1913, line: 2, type: !2832, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2852 = !DILocation(line: 2, column: 1, scope: !2851)
!2853 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerD0Ev", linkageName: "_CNW7builtinE20ExistentialContainerD0Ev", scope: !0, file: !1913, line: 2, type: !2854, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2854 = !DISubroutineType(types: !2855)
!2855 = !{!2856}
!2856 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2857, size: 64, align: 8)
!2857 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ExistentialContainer", file: !1913, line: 2, flags: DIFlagFwdDecl, elements: !2858)
!2858 = !{!2859, !2860, !2861}
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2857, file: !1913, line: 2, baseType: !9, size: 64, align: 64)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !2857, file: !1913, line: 2, baseType: !2784, size: 64, align: 64, offset: 64)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !2857, file: !1913, line: 2, baseType: !2796, size: 64, align: 64, offset: 128)
!2862 = !DILocation(line: 2, column: 1, scope: !2853)
!2863 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW7builtinE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !1913, line: 2, type: !2864, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2864 = !DISubroutineType(types: !2865)
!2865 = !{!2857}
!2866 = !DILocation(line: 2, column: 1, scope: !2863)
!2867 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW7builtinE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !1913, line: 2, type: !2868, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2868 = !DISubroutineType(types: !2869)
!2869 = !{!2856, !9, !2784, !2796}
!2870 = !DILocation(line: 2, column: 1, scope: !2867)
!2871 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW7builtinE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !1913, line: 2, type: !2868, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2872 = !DILocation(line: 2, column: 1, scope: !2871)
!2873 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerD3Ev", linkageName: "_CNW7builtinE20ExistentialContainerD3Ev", scope: null, file: !1913, line: 2, type: !2854, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2874 = !DILocation(line: 2, column: 1, scope: !2873)
