; ModuleID = '/Users/Jonas/CDot/StdLib/builtin/mod.dotm'
source_filename = "/Users/Jonas/CDot/StdLib/builtin/mod.dotm"

%"struct.builtin.<private name>.TypeInfo" = type <{ %"struct.builtin.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.builtin.<private name>.ValueWitnessTable"*, %"struct.builtin.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.builtin.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.builtin.<private name>.ProtocolConformance" = type <{ %"struct.builtin.<private name>.TypeInfo"*, i8** }>
%"struct.builtin.<private name>.Int64" = type <{ i64 }>
%"struct.builtin.<private name>.Bool" = type <{ i1 }>
%"struct.builtin.<private name>.ExistentialContainer" = type <{ i8*, %"struct.builtin.<private name>.TypeInfo"*, %"struct.builtin.<private name>.ProtocolConformance"* }>


!2304 = distinct !DISubprogram(name: "_CNW7builtinE9ctpop_u64EmL0", linkageName: "_CNW7builtinE9ctpop_u64EmL0", scope: null, file: !6, line: 87, type: !1472, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2305 = !DILocalVariable(name: "val", scope: !2304, file: !1, line: 87, type: !149)
!2306 = !DILocation(line: 87, column: 1321, scope: !2304)
!2307 = !DILocation(line: 87, column: 1378, scope: !2304)
!2308 = distinct !DISubprogram(name: "_CNW7builtinE14bitreverse_u64EmL0", linkageName: "_CNW7builtinE14bitreverse_u64EmL0", scope: null, file: !6, line: 87, type: !1472, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2309 = !DILocalVariable(name: "val", scope: !2308, file: !1, line: 87, type: !149)
!2310 = !DILocation(line: 87, column: 1459, scope: !2308)
!2311 = !DILocation(line: 87, column: 1521, scope: !2308)
!2312 = distinct !DISubprogram(name: "_CNW7builtinE9bswap_u64EmL0", linkageName: "_CNW7builtinE9bswap_u64EmL0", scope: null, file: !6, line: 87, type: !1472, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2313 = !DILocalVariable(name: "val", scope: !2312, file: !1, line: 87, type: !149)
!2314 = !DILocation(line: 87, column: 1607, scope: !2312)
!2315 = !DILocation(line: 87, column: 1664, scope: !2312)
!2316 = distinct !DISubprogram(name: "_CNW7builtinE9ctlz_u128EoL0", linkageName: "_CNW7builtinE9ctlz_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2317 = !DILocalVariable(name: "val", scope: !2316, file: !1, line: 87, type: !181)
!2318 = !DILocation(line: 87, column: 1035, scope: !2316)
!2319 = !DILocation(line: 87, column: 1091, scope: !2316)
!2320 = distinct !DISubprogram(name: "_CNW7builtinE9cttz_u128EoL0", linkageName: "_CNW7builtinE9cttz_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2321 = !DILocalVariable(name: "val", scope: !2320, file: !1, line: 87, type: !181)
!2322 = !DILocation(line: 87, column: 1178, scope: !2320)
!2323 = !DILocation(line: 87, column: 1234, scope: !2320)
!2324 = distinct !DISubprogram(name: "_CNW7builtinE10ctpop_u128EoL0", linkageName: "_CNW7builtinE10ctpop_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2325 = !DILocalVariable(name: "val", scope: !2324, file: !1, line: 87, type: !181)
!2326 = !DILocation(line: 87, column: 1321, scope: !2324)
!2327 = !DILocation(line: 87, column: 1378, scope: !2324)
!2328 = distinct !DISubprogram(name: "_CNW7builtinE15bitreverse_u128EoL0", linkageName: "_CNW7builtinE15bitreverse_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2329 = !DILocalVariable(name: "val", scope: !2328, file: !1, line: 87, type: !181)
!2330 = !DILocation(line: 87, column: 1459, scope: !2328)
!2331 = !DILocation(line: 87, column: 1521, scope: !2328)
!2332 = distinct !DISubprogram(name: "_CNW7builtinE10bswap_u128EoL0", linkageName: "_CNW7builtinE10bswap_u128EoL0", scope: null, file: !6, line: 87, type: !1494, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2333 = !DILocalVariable(name: "val", scope: !2332, file: !1, line: 87, type: !181)
!2334 = !DILocation(line: 87, column: 1607, scope: !2332)
!2335 = !DILocation(line: 87, column: 1664, scope: !2332)
!2336 = distinct !DISubprogram(name: "_CNW7builtinE4Bool4copyES0_L0", linkageName: "_CNW7builtinE4Bool4copyES0_L0", scope: !0, file: !1829, line: 2, type: !1836, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2337 = !DILocation(line: 2, column: 1, scope: !2336)
!2338 = distinct !DISubprogram(name: "_CNW7builtinE4Bool14__default_initES0_L0", linkageName: "_CNW7builtinE4Bool14__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !1836, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2339 = !DILocation(line: 2, column: 1, scope: !2338)
!2340 = distinct !DISubprogram(name: "_CNW7builtinE4BoolC1EbL5value", linkageName: "_CNW7builtinE4BoolC1EbL5value", scope: !0, file: !1829, line: 2, type: !2341, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2341 = !DISubroutineType(types: !2342)
!2342 = !{!1846, !1557}
!2343 = !DILocation(line: 2, column: 1, scope: !2340)
!2344 = distinct !DISubprogram(name: "_CNW7builtinE4BoolC2ES0_bL0L5value", linkageName: "_CNW7builtinE4BoolC2ES0_bL0L5value", scope: !0, file: !1829, line: 2, type: !2345, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2345 = !DISubroutineType(types: !2346)
!2346 = !{!1838, !1557}
!2347 = !DILocation(line: 2, column: 1, scope: !2344)
!2348 = distinct !DISubprogram(name: "_CNW7builtinE4BoolD3Ev", linkageName: "_CNW7builtinE4BoolD3Ev", scope: null, file: !1829, line: 2, type: !1844, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2349 = !DILocation(line: 2, column: 1, scope: !2348)
!2350 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableD0Ev", linkageName: "_CNW7builtinE17ValueWitnessTableD0Ev", scope: !0, file: !1829, line: 2, type: !2351, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2351 = !DISubroutineType(types: !2352)
!2352 = !{!2353}
!2353 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2354, size: 64, align: 8)
!2354 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ValueWitnessTable", file: !1829, line: 2, flags: DIFlagFwdDecl, elements: !2355)
!2355 = !{!2356, !2358}
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !2354, file: !1829, line: 2, baseType: !2357, size: 64, align: 64)
!2357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 8)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !2354, file: !1829, line: 2, baseType: !2359, size: 64, align: 64, offset: 64)
!2359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1869, size: 64, align: 8)
!2360 = !DILocation(line: 2, column: 1, scope: !2350)
!2361 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW7builtinE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !2362, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2362 = !DISubroutineType(types: !2363)
!2363 = !{!2354}
!2364 = !DILocation(line: 2, column: 1, scope: !2361)
!2365 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW7builtinE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !1829, line: 2, type: !2366, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2366 = !DISubroutineType(types: !2367)
!2367 = !{!2353, !2357, !2359}
!2368 = !DILocation(line: 2, column: 1, scope: !2365)
!2369 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", linkageName: "_CNW7builtinE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", scope: !0, file: !1829, line: 2, type: !2370, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2370 = !DISubroutineType(types: !2371)
!2371 = !{!2354, !2357, !2359}
!2372 = !DILocation(line: 2, column: 1, scope: !2369)
!2373 = distinct !DISubprogram(name: "_CNW7builtinE17ValueWitnessTableD3Ev", linkageName: "_CNW7builtinE17ValueWitnessTableD3Ev", scope: null, file: !1829, line: 2, type: !2351, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2374 = !DILocation(line: 2, column: 1, scope: !2373)
!2375 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceD0Ev", linkageName: "_CNW7builtinE19ProtocolConformanceD0Ev", scope: !0, file: !1829, line: 2, type: !2376, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2376 = !DISubroutineType(types: !2377)
!2377 = !{!2378}
!2378 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2379, size: 64, align: 8)
!2379 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ProtocolConformance", file: !1829, line: 2, flags: DIFlagFwdDecl, elements: !2380)
!2380 = !{!2381, !2398}
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !2379, file: !1829, line: 2, baseType: !2382, size: 64, align: 64)
!2382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2383, size: 64, align: 8)
!2383 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.TypeInfo", file: !1829, line: 2, flags: DIFlagFwdDecl, elements: !2384)
!2384 = !{!2385, !2386, !2388, !2389, !2391, !2393, !2395, !2396, !2397}
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !2383, file: !1829, line: 2, baseType: !2382, size: 64, align: 64)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2383, file: !1829, line: 2, baseType: !2387, size: 64, align: 64, offset: 64)
!2387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 8)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !2383, file: !1829, line: 2, baseType: !2359, size: 64, align: 64, offset: 128)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2383, file: !1829, line: 2, baseType: !2390, size: 64, align: 64, offset: 192)
!2390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 8)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !2383, file: !1829, line: 2, baseType: !2392, size: 64, align: 64, offset: 256)
!2392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2354, size: 64, align: 8)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !2383, file: !1829, line: 2, baseType: !2394, size: 64, align: 64, offset: 320)
!2394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2379, size: 64, align: 8)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2383, file: !1829, line: 2, baseType: !149, size: 64, align: 64, offset: 384)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2383, file: !1829, line: 2, baseType: !149, size: 64, align: 64, offset: 448)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !2383, file: !1829, line: 2, baseType: !149, size: 64, align: 64, offset: 512)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2379, file: !1829, line: 2, baseType: !2387, size: 64, align: 64, offset: 64)
!2399 = !DILocation(line: 2, column: 1, scope: !2375)
!2400 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW7builtinE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !2401, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2401 = !DISubroutineType(types: !2402)
!2402 = !{!2379}
!2403 = !DILocation(line: 2, column: 1, scope: !2400)
!2404 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW7builtinE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !1829, line: 2, type: !2405, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2405 = !DISubroutineType(types: !2406)
!2406 = !{!2378, !2382, !2387}
!2407 = !DILocation(line: 2, column: 1, scope: !2404)
!2408 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW7builtinE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !1829, line: 2, type: !2409, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2409 = !DISubroutineType(types: !2410)
!2410 = !{!2379, !2382, !2387}
!2411 = !DILocation(line: 2, column: 1, scope: !2408)
!2412 = distinct !DISubprogram(name: "_CNW7builtinE19ProtocolConformanceD3Ev", linkageName: "_CNW7builtinE19ProtocolConformanceD3Ev", scope: null, file: !1829, line: 2, type: !2376, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2413 = !DILocation(line: 2, column: 1, scope: !2412)
!2414 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoD0Ev", linkageName: "_CNW7builtinE8TypeInfoD0Ev", scope: !0, file: !1829, line: 2, type: !2415, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2415 = !DISubroutineType(types: !2416)
!2416 = !{!2417}
!2417 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2383, size: 64, align: 8)
!2418 = !DILocation(line: 2, column: 1, scope: !2414)
!2419 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfo14__default_initES0_L0", linkageName: "_CNW7builtinE8TypeInfo14__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !2420, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2420 = !DISubroutineType(types: !2421)
!2421 = !{!2383}
!2422 = !DILocation(line: 2, column: 1, scope: !2419)
!2423 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW7builtinE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !1829, line: 2, type: !2424, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2424 = !DISubroutineType(types: !2425)
!2425 = !{!2417, !2382, !2387, !2359, !2390, !2392, !2394, !149, !149, !149}
!2426 = !DILocation(line: 2, column: 1, scope: !2423)
!2427 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW7builtinE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !1829, line: 2, type: !2428, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2428 = !DISubroutineType(types: !2429)
!2429 = !{!2383, !2382, !2387, !2359, !2390, !2392, !2394, !149, !149, !149}
!2430 = !DILocation(line: 2, column: 1, scope: !2427)
!2431 = distinct !DISubprogram(name: "_CNW7builtinE8TypeInfoD3Ev", linkageName: "_CNW7builtinE8TypeInfoD3Ev", scope: null, file: !1829, line: 2, type: !2415, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2432 = !DILocation(line: 2, column: 1, scope: !2431)
!2433 = distinct !DISubprogram(name: "_CNW7builtinE5Int64D0Ev", linkageName: "_CNW7builtinE5Int64D0Ev", scope: !0, file: !1829, line: 2, type: !2434, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2434 = !DISubroutineType(types: !2435)
!2435 = !{!2436}
!2436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2437, size: 64, align: 8)
!2437 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.Int64", file: !1829, line: 2, flags: DIFlagFwdDecl, elements: !2438)
!2438 = !{!2439}
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2437, file: !1829, line: 2, baseType: !133, size: 64, align: 64)
!2440 = !DILocation(line: 2, column: 1, scope: !2433)
!2441 = distinct !DISubprogram(name: "_CNW7builtinE5Int644copyES0_L0", linkageName: "_CNW7builtinE5Int644copyES0_L0", scope: !0, file: !1829, line: 2, type: !2442, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2442 = !DISubroutineType(types: !2443)
!2443 = !{!2437}
!2444 = !DILocation(line: 2, column: 1, scope: !2441)
!2445 = distinct !DISubprogram(name: "_CNW7builtinE5Int6414__default_initES0_L0", linkageName: "_CNW7builtinE5Int6414__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !2442, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2446 = !DILocation(line: 2, column: 1, scope: !2445)
!2447 = distinct !DISubprogram(name: "_CNW7builtinE5Int64C1ElL5value", linkageName: "_CNW7builtinE5Int64C1ElL5value", scope: !0, file: !1829, line: 2, type: !2448, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2448 = !DISubroutineType(types: !2449)
!2449 = !{!2436, !133}
!2450 = !DILocation(line: 2, column: 1, scope: !2447)
!2451 = distinct !DISubprogram(name: "_CNW7builtinE5Int64C2ES0_lL0L5value", linkageName: "_CNW7builtinE5Int64C2ES0_lL0L5value", scope: !0, file: !1829, line: 2, type: !2452, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2452 = !DISubroutineType(types: !2453)
!2453 = !{!2437, !133}
!2454 = !DILocation(line: 2, column: 1, scope: !2451)
!2455 = distinct !DISubprogram(name: "_CNW7builtinE5Int64D3Ev", linkageName: "_CNW7builtinE5Int64D3Ev", scope: null, file: !1829, line: 2, type: !2434, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2456 = !DILocation(line: 2, column: 1, scope: !2455)
!2457 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerD0Ev", linkageName: "_CNW7builtinE20ExistentialContainerD0Ev", scope: !0, file: !1829, line: 2, type: !2458, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2458 = !DISubroutineType(types: !2459)
!2459 = !{!2460}
!2460 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !2461, size: 64, align: 8)
!2461 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.<private name>.ExistentialContainer", file: !1829, line: 2, flags: DIFlagFwdDecl, elements: !2462)
!2462 = !{!2463, !2464, !2465}
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2461, file: !1829, line: 2, baseType: !9, size: 64, align: 64)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !2461, file: !1829, line: 2, baseType: !2382, size: 64, align: 64, offset: 64)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !2461, file: !1829, line: 2, baseType: !2394, size: 64, align: 64, offset: 128)
!2466 = !DILocation(line: 2, column: 1, scope: !2457)
!2467 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW7builtinE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !1829, line: 2, type: !2468, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2468 = !DISubroutineType(types: !2469)
!2469 = !{!2461}
!2470 = !DILocation(line: 2, column: 1, scope: !2467)
!2471 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW7builtinE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !1829, line: 2, type: !2472, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2472 = !DISubroutineType(types: !2473)
!2473 = !{!2460, !9, !2382, !2394}
!2474 = !DILocation(line: 2, column: 1, scope: !2471)
!2475 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW7builtinE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !1829, line: 2, type: !2476, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!2476 = !DISubroutineType(types: !2477)
!2477 = !{!2461, !9, !2382, !2394}
!2478 = !DILocation(line: 2, column: 1, scope: !2475)
!2479 = distinct !DISubprogram(name: "_CNW7builtinE20ExistentialContainerD3Ev", linkageName: "_CNW7builtinE20ExistentialContainerD3Ev", scope: null, file: !1829, line: 2, type: !2458, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!2480 = !DILocation(line: 2, column: 1, scope: !2479)
