; ModuleID = '/Users/Jonas/CDot/StdLib/main/main.dot'
source_filename = "/Users/Jonas/CDot/StdLib/main/main.dot"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin18.6.0"

%"struct.main.<private name>.TypeInfo" = type <{ %"struct.main.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.main.<private name>.ValueWitnessTable"*, %"struct.main.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.main.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.main.<private name>.ProtocolConformance" = type <{ %"struct.main.<private name>.TypeInfo"*, i8** }>
%"struct.main.<private name>.Int64" = type <{ i64 }>
%"struct.main.Atomic<i64>" = type <{ i64 }>
%"struct.main.<private name>.Bool" = type <{ i1 }>
%"struct.main.<private name>.ExistentialContainer" = type <{ i8*, %"struct.main.<private name>.TypeInfo"*, %"struct.main.<private name>.ProtocolConformance"* }>


!121 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlEC2ERS0_lL0L10weirdValue", linkageName: "_CNW4mainE6AtomicIlEC2ERS0_lL0L10weirdValue", scope: !0, file: !11, line: 45, type: !23, isLocal: false, isDefinition: true, scopeLine: 45, thisAdjustment: 1, isOptimized: false, unit: !0)
!122 = !DILocalVariable(name: "self", scope: !121, file: !1, line: 45, type: !10)
!123 = !DILocation(line: 45, column: 6, scope: !121)
!124 = !DILocalVariable(name: "weirdValue", scope: !121, file: !1, line: 45, type: !14)
!125 = !DILocation(line: 46, column: 27, scope: !121)
!126 = !DILocation(line: 46, column: 10, scope: !121)
!127 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlE20checkValidStoreOrderEMS0_NW_0E11MemoryOrderEL0L0", linkageName: "_CNW4mainE6AtomicIlE20checkValidStoreOrderEMS0_NW_0E11MemoryOrderEL0L0", scope: !0, file: !11, line: 64, type: !128, isLocal: false, isDefinition: true, scopeLine: 64, thisAdjustment: 1, isOptimized: false, unit: !0)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !34}
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "MetaType<main.Atomic<i64>>", file: !1, size: 64, align: 64, elements: !131)
!131 = !{!132, !132, !132, !132, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 8)
!133 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed_char)
!134 = !DILocalVariable(name: "self", scope: !127, file: !1, line: 64, type: !130)
!135 = !DILocation(line: 64, column: 21, scope: !127)
!136 = !DILocalVariable(name: "memoryOrder", scope: !127, file: !1, line: 64, type: !34)
!137 = !DILocation(line: 65, column: 16, scope: !127)
!138 = !DILocation(line: 74, column: 14, scope: !127)
!139 = !DILocation(line: 72, column: 80, scope: !127)
!140 = !DILocation(line: 72, column: 18, scope: !127)
!141 = !DILocation(line: 67, column: 14, scope: !127)
!142 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlE19checkValidLoadOrderEMS0_NW_0E11MemoryOrderEL0L0", linkageName: "_CNW4mainE6AtomicIlE19checkValidLoadOrderEMS0_NW_0E11MemoryOrderEL0L0", scope: !0, file: !11, line: 50, type: !128, isLocal: false, isDefinition: true, scopeLine: 50, thisAdjustment: 1, isOptimized: false, unit: !0)
!143 = !DILocalVariable(name: "self", scope: !142, file: !1, line: 50, type: !130)
!144 = !DILocation(line: 50, column: 21, scope: !142)
!145 = !DILocalVariable(name: "memoryOrder", scope: !142, file: !1, line: 50, type: !34)
!146 = !DILocation(line: 51, column: 16, scope: !142)
!147 = !DILocation(line: 59, column: 14, scope: !142)
!148 = !DILocation(line: 57, column: 79, scope: !142)
!149 = !DILocation(line: 57, column: 18, scope: !142)
!150 = !DILocation(line: 53, column: 14, scope: !142)
!151 = distinct !DISubprogram(name: "_CNW4mainEXi2~=INW_0E11MemoryOrderEEEbNW_0E11MemoryOrderENW_0E11MemoryOrderEL0L0", linkageName: "_CNW4mainEXi2~=INW_0E11MemoryOrderEEEbNW_0E11MemoryOrderENW_0E11MemoryOrderEL0L0", scope: null, file: !11, line: 5, type: !78, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!152 = !DILocalVariable(name: "lhs", scope: !151, file: !1, line: 5, type: !34)
!153 = !DILocation(line: 5, column: 9, scope: !151)
!154 = !DILocalVariable(name: "rhs", scope: !151, file: !1, line: 5, type: !34)
!155 = !DILocation(line: 6, column: 6, scope: !151)
!156 = !DILocalVariable(name: "v1", scope: !151, file: !1, line: 6, type: !14)
!157 = !DILocation(line: 7, column: 6, scope: !151)
!158 = !DILocalVariable(name: "v2", scope: !151, file: !1, line: 7, type: !14)
!159 = !DILocation(line: 9, column: 13, scope: !151)
!160 = !DILocation(line: 9, column: 19, scope: !151)
!161 = distinct !DISubprogram(name: "_CNW4mainE4Bool4copyES0_L0", linkageName: "_CNW4mainE4Bool4copyES0_L0", scope: !0, file: !6, line: 1, type: !95, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!162 = !DILocation(line: 1, column: 2, scope: !161)
!163 = distinct !DISubprogram(name: "_CNW4mainE4Bool14__default_initES0_L0", linkageName: "_CNW4mainE4Bool14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !95, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!164 = !DILocation(line: 1, column: 2, scope: !163)
!165 = distinct !DISubprogram(name: "_CNW4mainE4BoolC1EbL5value", linkageName: "_CNW4mainE4BoolC1EbL5value", scope: !0, file: !6, line: 1, type: !166, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!166 = !DISubroutineType(types: !167)
!167 = !{!106, !100}
!168 = !DILocation(line: 1, column: 2, scope: !165)
!169 = distinct !DISubprogram(name: "_CNW4mainE4BoolC2ERS0_bL0L5value", linkageName: "_CNW4mainE4BoolC2ERS0_bL0L5value", scope: !0, file: !6, line: 1, type: !166, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!170 = !DILocation(line: 1, column: 2, scope: !169)
!171 = distinct !DISubprogram(name: "_CNW4mainE4BoolD3Ev", linkageName: "_CNW4mainE4BoolD3Ev", scope: null, file: !6, line: 1, type: !104, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!172 = !DILocation(line: 1, column: 2, scope: !171)
!173 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD0Ev", linkageName: "_CNW4mainE17ValueWitnessTableD0Ev", scope: !0, file: !6, line: 1, type: !174, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!174 = !DISubroutineType(types: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !177, size: 64, align: 8)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ValueWitnessTable", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !178)
!178 = !{!179, !184}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !177, file: !6, line: 1, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 8)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !177, file: !6, line: 1, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 8)
!186 = !DISubroutineType(types: !187)
!187 = !{!183}
!188 = !DILocation(line: 1, column: 2, scope: !173)
!189 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!190 = !DISubroutineType(types: !191)
!191 = !{!177}
!192 = !DILocation(line: 1, column: 2, scope: !189)
!193 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !6, line: 1, type: !194, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!194 = !DISubroutineType(types: !195)
!195 = !{!176, !180, !185}
!196 = !DILocation(line: 1, column: 2, scope: !193)
!197 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", scope: !0, file: !6, line: 1, type: !194, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!198 = !DILocation(line: 1, column: 2, scope: !197)
!199 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD3Ev", linkageName: "_CNW4mainE17ValueWitnessTableD3Ev", scope: null, file: !6, line: 1, type: !174, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!200 = !DILocation(line: 1, column: 2, scope: !199)
!201 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD0Ev", linkageName: "_CNW4mainE19ProtocolConformanceD0Ev", scope: !0, file: !6, line: 1, type: !202, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!202 = !DISubroutineType(types: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !205, size: 64, align: 8)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ProtocolConformance", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !206)
!206 = !{!207, !226}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !205, file: !6, line: 1, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 8)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.TypeInfo", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !210)
!210 = !{!211, !212, !214, !215, !218, !220, !222, !224, !225}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !209, file: !6, line: 1, baseType: !208, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !209, file: !6, line: 1, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !209, file: !6, line: 1, baseType: !185, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !6, line: 1, baseType: !216, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 8)
!217 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !209, file: !6, line: 1, baseType: !219, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !209, file: !6, line: 1, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !209, file: !6, line: 1, baseType: !223, size: 64, align: 64, offset: 384)
!223 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !209, file: !6, line: 1, baseType: !223, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !209, file: !6, line: 1, baseType: !223, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !205, file: !6, line: 1, baseType: !213, size: 64, align: 64, offset: 64)
!227 = !DILocation(line: 1, column: 2, scope: !201)
!228 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !229, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!229 = !DISubroutineType(types: !230)
!230 = !{!205}
!231 = !DILocation(line: 1, column: 2, scope: !228)
!232 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !6, line: 1, type: !233, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!233 = !DISubroutineType(types: !234)
!234 = !{!204, !208, !213}
!235 = !DILocation(line: 1, column: 2, scope: !232)
!236 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !6, line: 1, type: !233, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!237 = !DILocation(line: 1, column: 2, scope: !236)
!238 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD3Ev", linkageName: "_CNW4mainE19ProtocolConformanceD3Ev", scope: null, file: !6, line: 1, type: !202, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!239 = !DILocation(line: 1, column: 2, scope: !238)
!240 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD0Ev", linkageName: "_CNW4mainE8TypeInfoD0Ev", scope: !0, file: !6, line: 1, type: !241, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!241 = !DISubroutineType(types: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !209, size: 64, align: 8)
!244 = !DILocation(line: 1, column: 2, scope: !240)
!245 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfo14__default_initES0_L0", linkageName: "_CNW4mainE8TypeInfo14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !246, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!246 = !DISubroutineType(types: !247)
!247 = !{!209}
!248 = !DILocation(line: 1, column: 2, scope: !245)
!249 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 1, type: !250, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!250 = !DISubroutineType(types: !251)
!251 = !{!243, !208, !213, !185, !216, !219, !221, !223, !223, !223}
!252 = !DILocation(line: 1, column: 2, scope: !249)
!253 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 1, type: !250, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!254 = !DILocation(line: 1, column: 2, scope: !253)
!255 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD3Ev", linkageName: "_CNW4mainE8TypeInfoD3Ev", scope: null, file: !6, line: 1, type: !241, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!256 = !DILocation(line: 1, column: 2, scope: !255)
!257 = distinct !DISubprogram(name: "_CNW4mainE5Int64D0Ev", linkageName: "_CNW4mainE5Int64D0Ev", scope: !0, file: !6, line: 1, type: !258, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!258 = !DISubroutineType(types: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !261, size: 64, align: 8)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Int64", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !261, file: !6, line: 1, baseType: !14, size: 64, align: 64)
!264 = !DILocation(line: 1, column: 2, scope: !257)
!265 = distinct !DISubprogram(name: "_CNW4mainE5Int644copyES0_L0", linkageName: "_CNW4mainE5Int644copyES0_L0", scope: !0, file: !6, line: 1, type: !266, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!266 = !DISubroutineType(types: !267)
!267 = !{!261}
!268 = !DILocation(line: 1, column: 2, scope: !265)
!269 = distinct !DISubprogram(name: "_CNW4mainE5Int6414__default_initES0_L0", linkageName: "_CNW4mainE5Int6414__default_initES0_L0", scope: !0, file: !6, line: 1, type: !266, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!270 = !DILocation(line: 1, column: 2, scope: !269)
!271 = distinct !DISubprogram(name: "_CNW4mainE5Int64C1ElL5value", linkageName: "_CNW4mainE5Int64C1ElL5value", scope: !0, file: !6, line: 1, type: !272, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!272 = !DISubroutineType(types: !273)
!273 = !{!260, !14}
!274 = !DILocation(line: 1, column: 2, scope: !271)
!275 = distinct !DISubprogram(name: "_CNW4mainE5Int64C2ERS0_lL0L5value", linkageName: "_CNW4mainE5Int64C2ERS0_lL0L5value", scope: !0, file: !6, line: 1, type: !272, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!276 = !DILocation(line: 1, column: 2, scope: !275)
!277 = distinct !DISubprogram(name: "_CNW4mainE5Int64D3Ev", linkageName: "_CNW4mainE5Int64D3Ev", scope: null, file: !6, line: 1, type: !258, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!278 = !DILocation(line: 1, column: 2, scope: !277)
!279 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD0Ev", linkageName: "_CNW4mainE20ExistentialContainerD0Ev", scope: !0, file: !6, line: 1, type: !280, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!280 = !DISubroutineType(types: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !283, size: 64, align: 8)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ExistentialContainer", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !6, line: 1, baseType: !183, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !283, file: !6, line: 1, baseType: !208, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !283, file: !6, line: 1, baseType: !221, size: 64, align: 64, offset: 128)
!288 = !DILocation(line: 1, column: 2, scope: !279)
!289 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !290, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!290 = !DISubroutineType(types: !291)
!291 = !{!283}
!292 = !DILocation(line: 1, column: 2, scope: !289)
!293 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 1, type: !294, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!294 = !DISubroutineType(types: !295)
!295 = !{!282, !183, !208, !221}
!296 = !DILocation(line: 1, column: 2, scope: !293)
!297 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 1, type: !294, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!298 = !DILocation(line: 1, column: 2, scope: !297)
!299 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD3Ev", linkageName: "_CNW4mainE20ExistentialContainerD3Ev", scope: null, file: !6, line: 1, type: !280, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!300 = !DILocation(line: 1, column: 2, scope: !299)
