; ModuleID = '/Users/Jonas/CDot/StdLib/main/main.dot'
source_filename = "/Users/Jonas/CDot/StdLib/main/main.dot"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin18.0.0"

%"struct.main.<private name>.TypeInfo" = type <{ %"struct.main.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.main.<private name>.ValueWitnessTable"*, %"struct.main.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.main.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.main.<private name>.ProtocolConformance" = type <{ %"struct.main.<private name>.TypeInfo"*, i8** }>
%"struct.main.<private name>.Int64" = type <{ i64 }>
%"struct.main.<private name>.Bool" = type <{ i1 }>
%"struct.main.<private name>.ExistentialContainer" = type <{ i8*, %"struct.main.<private name>.TypeInfo"*, %"struct.main.<private name>.ProtocolConformance"* }>


!48 = distinct !DISubprogram(name: "_CNW4mainE11MemoryOrderC1EiL8rawValue", linkageName: "_CNW4mainE11MemoryOrderC1EiL8rawValue", scope: !0, file: !22, line: 6, type: !49, isLocal: false, isDefinition: true, scopeLine: 6, thisAdjustment: 1, isOptimized: false, unit: !0)
!49 = !DISubroutineType(types: !50)
!50 = !{!25, !51}
!51 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!52 = !DILocation(line: 6, column: 9, scope: !48)
!53 = distinct !DISubprogram(name: "_CNW4mainE11MemoryOrderGa8rawValueES_L0", linkageName: "_CNW4mainE11MemoryOrderGa8rawValueES_L0", scope: !0, file: !22, line: 6, type: !37, isLocal: false, isDefinition: true, scopeLine: 6, thisAdjustment: 1, isOptimized: false, unit: !0)
!54 = !DILocation(line: 6, column: 9, scope: !53)
!55 = distinct !DISubprogram(name: "_CNW4mainE11MemoryOrderD3Ev", linkageName: "_CNW4mainE11MemoryOrderD3Ev", scope: null, file: !22, line: 6, type: !23, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!56 = !DILocation(line: 6, column: 9, scope: !55)
!57 = distinct !DISubprogram(name: "_CNW4mainE11MemoryOrderXi2~=ES_S_L0L0", linkageName: "_CNW4mainE11MemoryOrderXi2~=ES_S_L0L0", scope: !0, file: !22, line: 25, type: !41, isLocal: false, isDefinition: true, scopeLine: 25, thisAdjustment: 1, isOptimized: false, unit: !0)
!58 = !DILocalVariable(name: "self", scope: !57, file: !1, line: 25, type: !26)
!59 = !DILocation(line: 25, column: 6, scope: !57)
!60 = !DILocalVariable(name: "rhs", scope: !57, file: !1, line: 25, type: !26)
!61 = !DILocation(line: 26, column: 10, scope: !57)
!62 = distinct !DISubprogram(name: "_CNW4mainE4BoolXp1!ES0_L0", linkageName: "_CNW4mainE4BoolXp1!ES0_L0", scope: !0, file: !6, line: 2, type: !63, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Bool", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !6, line: 2, baseType: !68, size: 8, align: 8)
!68 = !DIBasicType(name: "i1", size: 8, encoding: DW_ATE_boolean)
!69 = !DILocalVariable(name: "self", scope: !62, file: !1, line: 2, type: !65)
!70 = !DILocation(line: 2, column: 1, scope: !62)
!71 = distinct !DISubprogram(name: "_CNW4mainE4BoolD0Ev", linkageName: "_CNW4mainE4BoolD0Ev", scope: !0, file: !6, line: 2, type: !72, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!72 = !DISubroutineType(types: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !65, size: 64, align: 8)
!75 = !DILocation(line: 2, column: 1, scope: !71)
!76 = distinct !DISubprogram(name: "_CNW4mainE4funcElL2v1", linkageName: "_CNW4mainE4funcElL2v1", scope: null, file: !22, line: 30, type: !16, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!77 = !DILocalVariable(name: "v1", scope: !76, file: !1, line: 30, type: !9)
!78 = !DILocation(line: 30, column: 2, scope: !76)
!79 = !DILocation(line: 30, column: 28, scope: !76)
!80 = distinct !DISubprogram(name: "_CNW4mainE4funcElL2v2", linkageName: "_CNW4mainE4funcElL2v2", scope: null, file: !22, line: 31, type: !16, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!81 = !DILocalVariable(name: "v2", scope: !80, file: !1, line: 31, type: !9)
!82 = !DILocation(line: 31, column: 2, scope: !80)
!83 = !DILocation(line: 31, column: 28, scope: !80)
!84 = distinct !DISubprogram(name: "_CNW4mainE4Bool4copyES0_L0", linkageName: "_CNW4mainE4Bool4copyES0_L0", scope: !0, file: !6, line: 2, type: !63, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!85 = !DILocation(line: 2, column: 1, scope: !84)
!86 = distinct !DISubprogram(name: "_CNW4mainE4Bool14__default_initES0_L0", linkageName: "_CNW4mainE4Bool14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !63, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!87 = !DILocation(line: 2, column: 1, scope: !86)
!88 = distinct !DISubprogram(name: "_CNW4mainE4BoolC1EbL5value", linkageName: "_CNW4mainE4BoolC1EbL5value", scope: !0, file: !6, line: 2, type: !89, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!89 = !DISubroutineType(types: !90)
!90 = !{!74, !68}
!91 = !DILocation(line: 2, column: 1, scope: !88)
!92 = distinct !DISubprogram(name: "_CNW4mainE4BoolC2ES0_bL0L5value", linkageName: "_CNW4mainE4BoolC2ES0_bL0L5value", scope: !0, file: !6, line: 2, type: !93, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!93 = !DISubroutineType(types: !94)
!94 = !{!65, !68}
!95 = !DILocation(line: 2, column: 1, scope: !92)
!96 = distinct !DISubprogram(name: "_CNW4mainE4BoolD3Ev", linkageName: "_CNW4mainE4BoolD3Ev", scope: null, file: !6, line: 2, type: !72, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!97 = !DILocation(line: 2, column: 1, scope: !96)
!98 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD0Ev", linkageName: "_CNW4mainE17ValueWitnessTableD0Ev", scope: !0, file: !6, line: 2, type: !99, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!99 = !DISubroutineType(types: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !102, size: 64, align: 8)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ValueWitnessTable", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !103)
!103 = !{!104, !109}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !102, file: !6, line: 2, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 8)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !102, file: !6, line: 2, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 8)
!111 = !DISubroutineType(types: !112)
!112 = !{!108}
!113 = !DILocation(line: 2, column: 1, scope: !98)
!114 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !115, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!115 = !DISubroutineType(types: !116)
!116 = !{!102}
!117 = !DILocation(line: 2, column: 1, scope: !114)
!118 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !6, line: 2, type: !119, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!119 = !DISubroutineType(types: !120)
!120 = !{!101, !105, !110}
!121 = !DILocation(line: 2, column: 1, scope: !118)
!122 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", scope: !0, file: !6, line: 2, type: !123, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!123 = !DISubroutineType(types: !124)
!124 = !{!102, !105, !110}
!125 = !DILocation(line: 2, column: 1, scope: !122)
!126 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD3Ev", linkageName: "_CNW4mainE17ValueWitnessTableD3Ev", scope: null, file: !6, line: 2, type: !99, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!127 = !DILocation(line: 2, column: 1, scope: !126)
!128 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD0Ev", linkageName: "_CNW4mainE19ProtocolConformanceD0Ev", scope: !0, file: !6, line: 2, type: !129, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!129 = !DISubroutineType(types: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !132, size: 64, align: 8)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ProtocolConformance", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !133)
!133 = !{!134, !153}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !132, file: !6, line: 2, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 8)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.TypeInfo", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !137)
!137 = !{!138, !139, !141, !142, !145, !147, !149, !151, !152}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !136, file: !6, line: 2, baseType: !135, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !136, file: !6, line: 2, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !136, file: !6, line: 2, baseType: !110, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !6, line: 2, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 8)
!144 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !136, file: !6, line: 2, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !136, file: !6, line: 2, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !136, file: !6, line: 2, baseType: !150, size: 64, align: 64, offset: 384)
!150 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !136, file: !6, line: 2, baseType: !150, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !136, file: !6, line: 2, baseType: !150, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !132, file: !6, line: 2, baseType: !140, size: 64, align: 64, offset: 64)
!154 = !DILocation(line: 2, column: 1, scope: !128)
!155 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !156, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!156 = !DISubroutineType(types: !157)
!157 = !{!132}
!158 = !DILocation(line: 2, column: 1, scope: !155)
!159 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !6, line: 2, type: !160, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!160 = !DISubroutineType(types: !161)
!161 = !{!131, !135, !140}
!162 = !DILocation(line: 2, column: 1, scope: !159)
!163 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !6, line: 2, type: !164, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!164 = !DISubroutineType(types: !165)
!165 = !{!132, !135, !140}
!166 = !DILocation(line: 2, column: 1, scope: !163)
!167 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD3Ev", linkageName: "_CNW4mainE19ProtocolConformanceD3Ev", scope: null, file: !6, line: 2, type: !129, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!168 = !DILocation(line: 2, column: 1, scope: !167)
!169 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD0Ev", linkageName: "_CNW4mainE8TypeInfoD0Ev", scope: !0, file: !6, line: 2, type: !170, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!170 = !DISubroutineType(types: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136, size: 64, align: 8)
!173 = !DILocation(line: 2, column: 1, scope: !169)
!174 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfo14__default_initES0_L0", linkageName: "_CNW4mainE8TypeInfo14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !175, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!175 = !DISubroutineType(types: !176)
!176 = !{!136}
!177 = !DILocation(line: 2, column: 1, scope: !174)
!178 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 2, type: !179, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!179 = !DISubroutineType(types: !180)
!180 = !{!172, !135, !140, !110, !143, !146, !148, !150, !150, !150}
!181 = !DILocation(line: 2, column: 1, scope: !178)
!182 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 2, type: !183, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!183 = !DISubroutineType(types: !184)
!184 = !{!136, !135, !140, !110, !143, !146, !148, !150, !150, !150}
!185 = !DILocation(line: 2, column: 1, scope: !182)
!186 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD3Ev", linkageName: "_CNW4mainE8TypeInfoD3Ev", scope: null, file: !6, line: 2, type: !170, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!187 = !DILocation(line: 2, column: 1, scope: !186)
!188 = distinct !DISubprogram(name: "_CNW4mainE5Int64D0Ev", linkageName: "_CNW4mainE5Int64D0Ev", scope: !0, file: !6, line: 2, type: !189, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!189 = !DISubroutineType(types: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !192, size: 64, align: 8)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Int64", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !193)
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !192, file: !6, line: 2, baseType: !9, size: 64, align: 64)
!195 = !DILocation(line: 2, column: 1, scope: !188)
!196 = distinct !DISubprogram(name: "_CNW4mainE5Int644copyES0_L0", linkageName: "_CNW4mainE5Int644copyES0_L0", scope: !0, file: !6, line: 2, type: !197, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!197 = !DISubroutineType(types: !198)
!198 = !{!192}
!199 = !DILocation(line: 2, column: 1, scope: !196)
!200 = distinct !DISubprogram(name: "_CNW4mainE5Int6414__default_initES0_L0", linkageName: "_CNW4mainE5Int6414__default_initES0_L0", scope: !0, file: !6, line: 2, type: !197, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!201 = !DILocation(line: 2, column: 1, scope: !200)
!202 = distinct !DISubprogram(name: "_CNW4mainE5Int64C1ElL5value", linkageName: "_CNW4mainE5Int64C1ElL5value", scope: !0, file: !6, line: 2, type: !203, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!203 = !DISubroutineType(types: !204)
!204 = !{!191, !9}
!205 = !DILocation(line: 2, column: 1, scope: !202)
!206 = distinct !DISubprogram(name: "_CNW4mainE5Int64C2ES0_lL0L5value", linkageName: "_CNW4mainE5Int64C2ES0_lL0L5value", scope: !0, file: !6, line: 2, type: !207, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!207 = !DISubroutineType(types: !208)
!208 = !{!192, !9}
!209 = !DILocation(line: 2, column: 1, scope: !206)
!210 = distinct !DISubprogram(name: "_CNW4mainE5Int64D3Ev", linkageName: "_CNW4mainE5Int64D3Ev", scope: null, file: !6, line: 2, type: !189, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!211 = !DILocation(line: 2, column: 1, scope: !210)
!212 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD0Ev", linkageName: "_CNW4mainE20ExistentialContainerD0Ev", scope: !0, file: !6, line: 2, type: !213, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!213 = !DISubroutineType(types: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !216, size: 64, align: 8)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ExistentialContainer", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !6, line: 2, baseType: !108, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !216, file: !6, line: 2, baseType: !135, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !216, file: !6, line: 2, baseType: !148, size: 64, align: 64, offset: 128)
!221 = !DILocation(line: 2, column: 1, scope: !212)
!222 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !223, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!223 = !DISubroutineType(types: !224)
!224 = !{!216}
!225 = !DILocation(line: 2, column: 1, scope: !222)
!226 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 2, type: !227, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!227 = !DISubroutineType(types: !228)
!228 = !{!215, !108, !135, !148}
!229 = !DILocation(line: 2, column: 1, scope: !226)
!230 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 2, type: !231, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!231 = !DISubroutineType(types: !232)
!232 = !{!216, !108, !135, !148}
!233 = !DILocation(line: 2, column: 1, scope: !230)
!234 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD3Ev", linkageName: "_CNW4mainE20ExistentialContainerD3Ev", scope: null, file: !6, line: 2, type: !213, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!235 = !DILocation(line: 2, column: 1, scope: !234)
