; ModuleID = '/Users/Jonas/CDot/cmake-build-debug/test/main.dot'
source_filename = "/Users/Jonas/CDot/cmake-build-debug/test/main.dot"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin18.0.0"

%"struct.main.<private name>.TypeInfo" = type <{ %"struct.main.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.main.<private name>.ValueWitnessTable"*, %"struct.main.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.main.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.main.<private name>.ProtocolConformance" = type <{ %"struct.main.<private name>.TypeInfo"*, i8** }>
%"struct.main.<private name>.Int64" = type <{ i64 }>
%struct.main.S = type <{ i8* }>
%struct.main.Circle = type <{ float }>
%struct.main.X = type <{ i8* }>
%"struct.main.<private name>.Bool" = type <{ i1 }>
%"struct.main.<private name>.ExistentialContainer" = type <{ i8*, %"struct.main.<private name>.TypeInfo"*, %"struct.main.<private name>.ProtocolConformance"* }>


!92 = !DISubroutineType(types: !93)
!93 = !{!10, !94}
!94 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DILocalVariable(name: "self", scope: !91, file: !1, line: 62, type: !10)
!96 = !DILocation(line: 62, column: 6, scope: !91)
!97 = !DILocalVariable(name: "x", scope: !91, file: !1, line: 62, type: !94)
!98 = !DILocation(line: 63, column: 35, scope: !91)
!99 = !DILocation(line: 63, column: 14, scope: !91)
!100 = distinct !DISubprogram(name: "_CNW4mainE1S9makeShapeES_L0", linkageName: "_CNW4mainE1S9makeShapeES_L0", scope: !0, file: !11, line: 66, type: !22, isLocal: false, isDefinition: true, scopeLine: 66, thisAdjustment: 1, isOptimized: false, unit: !0)
!101 = !DILocalVariable(name: "self", scope: !100, file: !1, line: 66, type: !10)
!102 = !DILocation(line: 66, column: 6, scope: !100)
!103 = !DILocation(line: 67, column: 17, scope: !100)
!104 = distinct !DISubprogram(name: "_CNW4mainE1SGa6heeheeES_L0", linkageName: "_CNW4mainE1SGa6heeheeES_L0", scope: !0, file: !11, line: 70, type: !22, isLocal: false, isDefinition: true, scopeLine: 70, thisAdjustment: 1, isOptimized: false, unit: !0)
!105 = !DILocalVariable(name: "self", scope: !104, file: !1, line: 70, type: !10)
!106 = !DILocation(line: 70, column: 6, scope: !104)
!107 = !DILocation(line: 70, column: 33, scope: !104)
!108 = distinct !DISubprogram(name: "_CNW4mainE1S14__default_initES_L0", linkageName: "_CNW4mainE1S14__default_initES_L0", scope: !0, file: !11, line: 54, type: !22, isLocal: false, isDefinition: true, scopeLine: 54, thisAdjustment: 1, isOptimized: false, unit: !0)
!109 = !DILocation(line: 54, column: 2, scope: !108)
!110 = distinct !DISubprogram(name: "_CNW4mainE1SC2ES_L0", linkageName: "_CNW4mainE1SC2ES_L0", scope: !0, file: !11, line: 54, type: !22, isLocal: false, isDefinition: true, scopeLine: 54, thisAdjustment: 1, isOptimized: false, unit: !0)
!111 = !DILocation(line: 54, column: 2, scope: !110)
!112 = distinct !DISubprogram(name: "_CNW4mainE1SD3Ev", linkageName: "_CNW4mainE1SD3Ev", scope: null, file: !11, line: 54, type: !17, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!113 = !DILocation(line: 54, column: 2, scope: !112)
!114 = distinct !DISubprogram(name: "_CNW4mainE4BoolD0Ev", linkageName: "_CNW4mainE4BoolD0Ev", scope: !0, file: !6, line: 2, type: !115, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!115 = !DISubroutineType(types: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !118, size: 64, align: 8)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Bool", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !118, file: !6, line: 2, baseType: !121, size: 8, align: 8)
!121 = !DIBasicType(name: "i1", size: 8, encoding: DW_ATE_boolean)
!122 = !DILocation(line: 2, column: 1, scope: !114)
!123 = distinct !DISubprogram(name: "_CNW4mainE4Bool4copyES0_L0", linkageName: "_CNW4mainE4Bool4copyES0_L0", scope: !0, file: !6, line: 2, type: !124, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!124 = !DISubroutineType(types: !125)
!125 = !{!118}
!126 = !DILocation(line: 2, column: 1, scope: !123)
!127 = distinct !DISubprogram(name: "_CNW4mainE4Bool14__default_initES0_L0", linkageName: "_CNW4mainE4Bool14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !124, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!128 = !DILocation(line: 2, column: 1, scope: !127)
!129 = distinct !DISubprogram(name: "_CNW4mainE4BoolC1EbL5value", linkageName: "_CNW4mainE4BoolC1EbL5value", scope: !0, file: !6, line: 2, type: !130, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!130 = !DISubroutineType(types: !131)
!131 = !{!117, !121}
!132 = !DILocation(line: 2, column: 1, scope: !129)
!133 = distinct !DISubprogram(name: "_CNW4mainE4BoolC2ES0_bL0L5value", linkageName: "_CNW4mainE4BoolC2ES0_bL0L5value", scope: !0, file: !6, line: 2, type: !134, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!134 = !DISubroutineType(types: !135)
!135 = !{!118, !121}
!136 = !DILocation(line: 2, column: 1, scope: !133)
!137 = distinct !DISubprogram(name: "_CNW4mainE4BoolD3Ev", linkageName: "_CNW4mainE4BoolD3Ev", scope: null, file: !6, line: 2, type: !115, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!138 = !DILocation(line: 2, column: 1, scope: !137)
!139 = distinct !DISubprogram(name: "_CNW4mainE4BoolXp1!ES0_L0", linkageName: "_CNW4mainE4BoolXp1!ES0_L0", scope: !0, file: !6, line: 2, type: !124, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!140 = !DILocalVariable(name: "self", scope: !139, file: !1, line: 2, type: !118)
!141 = !DILocation(line: 2, column: 1, scope: !139)
!142 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD0Ev", linkageName: "_CNW4mainE17ValueWitnessTableD0Ev", scope: !0, file: !6, line: 2, type: !143, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!143 = !DISubroutineType(types: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !146, size: 64, align: 8)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ValueWitnessTable", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !147)
!147 = !{!148, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !146, file: !6, line: 2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 8)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !146, file: !6, line: 2, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 8)
!155 = !DISubroutineType(types: !156)
!156 = !{!152}
!157 = !DILocation(line: 2, column: 1, scope: !142)
!158 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !159, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!159 = !DISubroutineType(types: !160)
!160 = !{!146}
!161 = !DILocation(line: 2, column: 1, scope: !158)
!162 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !6, line: 2, type: !163, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!163 = !DISubroutineType(types: !164)
!164 = !{!145, !149, !154}
!165 = !DILocation(line: 2, column: 1, scope: !162)
!166 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC2ES0_DoFvPvKPvEDoFvS1_EL0L6copyFnL6deinit", scope: !0, file: !6, line: 2, type: !167, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!167 = !DISubroutineType(types: !168)
!168 = !{!146, !149, !154}
!169 = !DILocation(line: 2, column: 1, scope: !166)
!170 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD3Ev", linkageName: "_CNW4mainE17ValueWitnessTableD3Ev", scope: null, file: !6, line: 2, type: !143, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!171 = !DILocation(line: 2, column: 1, scope: !170)
!172 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD0Ev", linkageName: "_CNW4mainE19ProtocolConformanceD0Ev", scope: !0, file: !6, line: 2, type: !173, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!173 = !DISubroutineType(types: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !176, size: 64, align: 8)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ProtocolConformance", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !177)
!177 = !{!178, !196}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !176, file: !6, line: 2, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 8)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.TypeInfo", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !181)
!181 = !{!182, !183, !185, !186, !188, !190, !192, !194, !195}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !180, file: !6, line: 2, baseType: !179, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !180, file: !6, line: 2, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !180, file: !6, line: 2, baseType: !154, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !6, line: 2, baseType: !187, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !180, file: !6, line: 2, baseType: !189, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !180, file: !6, line: 2, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !6, line: 2, baseType: !193, size: 64, align: 64, offset: 384)
!193 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !180, file: !6, line: 2, baseType: !193, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !180, file: !6, line: 2, baseType: !193, size: 64, align: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !176, file: !6, line: 2, baseType: !184, size: 64, align: 64, offset: 64)
!197 = !DILocation(line: 2, column: 1, scope: !172)
!198 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !199, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!199 = !DISubroutineType(types: !200)
!200 = !{!176}
!201 = !DILocation(line: 2, column: 1, scope: !198)
!202 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !6, line: 2, type: !203, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!203 = !DISubroutineType(types: !204)
!204 = !{!175, !179, !184}
!205 = !DILocation(line: 2, column: 1, scope: !202)
!206 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC2ES0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !6, line: 2, type: !207, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!207 = !DISubroutineType(types: !208)
!208 = !{!176, !179, !184}
!209 = !DILocation(line: 2, column: 1, scope: !206)
!210 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD3Ev", linkageName: "_CNW4mainE19ProtocolConformanceD3Ev", scope: null, file: !6, line: 2, type: !173, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!211 = !DILocation(line: 2, column: 1, scope: !210)
!212 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD0Ev", linkageName: "_CNW4mainE8TypeInfoD0Ev", scope: !0, file: !6, line: 2, type: !213, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!213 = !DISubroutineType(types: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !180, size: 64, align: 8)
!216 = !DILocation(line: 2, column: 1, scope: !212)
!217 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfo14__default_initES0_L0", linkageName: "_CNW4mainE8TypeInfo14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !218, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!218 = !DISubroutineType(types: !219)
!219 = !{!180}
!220 = !DILocation(line: 2, column: 1, scope: !217)
!221 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 2, type: !222, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!222 = !DISubroutineType(types: !223)
!223 = !{!215, !179, !184, !154, !187, !189, !191, !193, !193, !193}
!224 = !DILocation(line: 2, column: 1, scope: !221)
!225 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC2ES0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 2, type: !226, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!226 = !DISubroutineType(types: !227)
!227 = !{!180, !179, !184, !154, !187, !189, !191, !193, !193, !193}
!228 = !DILocation(line: 2, column: 1, scope: !225)
!229 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD3Ev", linkageName: "_CNW4mainE8TypeInfoD3Ev", scope: null, file: !6, line: 2, type: !213, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!230 = !DILocation(line: 2, column: 1, scope: !229)
!231 = distinct !DISubprogram(name: "_CNW4mainE5Int64D0Ev", linkageName: "_CNW4mainE5Int64D0Ev", scope: !0, file: !6, line: 2, type: !232, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!232 = !DISubroutineType(types: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !235, size: 64, align: 8)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Int64", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !235, file: !6, line: 2, baseType: !238, size: 64, align: 64)
!238 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!239 = !DILocation(line: 2, column: 1, scope: !231)
!240 = distinct !DISubprogram(name: "_CNW4mainE5Int644copyES0_L0", linkageName: "_CNW4mainE5Int644copyES0_L0", scope: !0, file: !6, line: 2, type: !241, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!241 = !DISubroutineType(types: !242)
!242 = !{!235}
!243 = !DILocation(line: 2, column: 1, scope: !240)
!244 = distinct !DISubprogram(name: "_CNW4mainE5Int6414__default_initES0_L0", linkageName: "_CNW4mainE5Int6414__default_initES0_L0", scope: !0, file: !6, line: 2, type: !241, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!245 = !DILocation(line: 2, column: 1, scope: !244)
!246 = distinct !DISubprogram(name: "_CNW4mainE5Int64C1ElL5value", linkageName: "_CNW4mainE5Int64C1ElL5value", scope: !0, file: !6, line: 2, type: !247, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!247 = !DISubroutineType(types: !248)
!248 = !{!234, !238}
!249 = !DILocation(line: 2, column: 1, scope: !246)
!250 = distinct !DISubprogram(name: "_CNW4mainE5Int64C2ES0_lL0L5value", linkageName: "_CNW4mainE5Int64C2ES0_lL0L5value", scope: !0, file: !6, line: 2, type: !251, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!251 = !DISubroutineType(types: !252)
!252 = !{!235, !238}
!253 = !DILocation(line: 2, column: 1, scope: !250)
!254 = distinct !DISubprogram(name: "_CNW4mainE5Int64D3Ev", linkageName: "_CNW4mainE5Int64D3Ev", scope: null, file: !6, line: 2, type: !232, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!255 = !DILocation(line: 2, column: 1, scope: !254)
!256 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD0Ev", linkageName: "_CNW4mainE20ExistentialContainerD0Ev", scope: !0, file: !6, line: 2, type: !257, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!257 = !DISubroutineType(types: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !260, size: 64, align: 8)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ExistentialContainer", file: !6, line: 2, flags: DIFlagFwdDecl, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !6, line: 2, baseType: !152, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !260, file: !6, line: 2, baseType: !179, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !260, file: !6, line: 2, baseType: !191, size: 64, align: 64, offset: 128)
!265 = !DILocation(line: 2, column: 1, scope: !256)
!266 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !6, line: 2, type: !267, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!267 = !DISubroutineType(types: !268)
!268 = !{!260}
!269 = !DILocation(line: 2, column: 1, scope: !266)
!270 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 2, type: !271, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!271 = !DISubroutineType(types: !272)
!272 = !{!259, !152, !179, !191}
!273 = !DILocation(line: 2, column: 1, scope: !270)
!274 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC2ES0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 2, type: !275, isLocal: false, isDefinition: true, scopeLine: 2, thisAdjustment: 1, isOptimized: false, unit: !0)
!275 = !DISubroutineType(types: !276)
!276 = !{!260, !152, !179, !191}
!277 = !DILocation(line: 2, column: 1, scope: !274)
!278 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD3Ev", linkageName: "_CNW4mainE20ExistentialContainerD3Ev", scope: null, file: !6, line: 2, type: !257, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!279 = !DILocation(line: 2, column: 1, scope: !278)
