; ModuleID = '/Users/Jonas/CDot/StdLib/main/main.dot'
source_filename = "/Users/Jonas/CDot/StdLib/main/main.dot"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin18.0.0"

%"struct.main.<private name>.TypeInfo" = type <{ %"struct.main.<private name>.TypeInfo"*, i8**, void (i8*)*, i8*, %"struct.main.<private name>.ValueWitnessTable"*, %"struct.main.<private name>.ProtocolConformance"*, i64, i64, i64 }>
%"struct.main.<private name>.ValueWitnessTable" = type <{ void (i8*, i8*)*, void (i8*)* }>
%"struct.main.<private name>.ProtocolConformance" = type <{ %"struct.main.<private name>.TypeInfo"*, i8** }>
%"struct.main.<private name>.Int64" = type <{ i64 }>
%"struct.main.Atomic<i64>" = type <{ i64 }>
%"struct.main.<private name>.Bool" = type <{ i1 }>
%"struct.main.<private name>.ExistentialContainer" = type <{ i8*, %"struct.main.<private name>.TypeInfo"*, %"struct.main.<private name>.ProtocolConformance"* }>


!119 = !DILocation(line: 33, column: 2, scope: !117)
!120 = !DILocation(line: 33, column: 28, scope: !117)
!121 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlE4copyES0_L0", linkageName: "_CNW4mainE6AtomicIlE4copyES0_L0", scope: !0, file: !11, line: 39, type: !122, isLocal: false, isDefinition: true, scopeLine: 39, thisAdjustment: 1, isOptimized: false, unit: !0)
!122 = !DISubroutineType(types: !123)
!123 = !{!10}
!124 = !DILocation(line: 39, column: 9, scope: !121)
!125 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlE14__default_initES0_L0", linkageName: "_CNW4mainE6AtomicIlE14__default_initES0_L0", scope: !0, file: !11, line: 39, type: !122, isLocal: false, isDefinition: true, scopeLine: 39, thisAdjustment: 1, isOptimized: false, unit: !0)
!126 = !DILocation(line: 39, column: 9, scope: !125)
!127 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlED3Ev", linkageName: "_CNW4mainE6AtomicIlED3Ev", scope: null, file: !11, line: 39, type: !63, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!128 = !DILocation(line: 39, column: 9, scope: !127)
!129 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlEC2ERS0_lL0L5value", linkageName: "_CNW4mainE6AtomicIlEC2ERS0_lL0L5value", scope: !0, file: !11, line: 44, type: !23, isLocal: false, isDefinition: true, scopeLine: 44, thisAdjustment: 1, isOptimized: false, unit: !0)
!130 = !DILocalVariable(name: "self", scope: !129, file: !1, line: 44, type: !10)
!131 = !DILocation(line: 44, column: 6, scope: !129)
!132 = !DILocalVariable(name: "value", scope: !129, file: !1, line: 44, type: !14)
!133 = !DILocation(line: 45, column: 10, scope: !129)
!134 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlEC2ERS0_lL0L10weirdValue", linkageName: "_CNW4mainE6AtomicIlEC2ERS0_lL0L10weirdValue", scope: !0, file: !11, line: 48, type: !23, isLocal: false, isDefinition: true, scopeLine: 48, thisAdjustment: 1, isOptimized: false, unit: !0)
!135 = !DILocalVariable(name: "self", scope: !134, file: !1, line: 48, type: !10)
!136 = !DILocation(line: 48, column: 6, scope: !134)
!137 = !DILocalVariable(name: "weirdValue", scope: !134, file: !1, line: 48, type: !14)
!138 = !DILocation(line: 49, column: 27, scope: !134)
!139 = !DILocation(line: 49, column: 10, scope: !134)
!140 = distinct !DISubprogram(name: "_CNW4mainE6AtomicIlE19checkValidLoadOrderEMS0_NW_0E11MemoryOrderEL0L0", linkageName: "_CNW4mainE6AtomicIlE19checkValidLoadOrderEMS0_NW_0E11MemoryOrderEL0L0", scope: !0, file: !11, line: 53, type: !141, isLocal: false, isDefinition: true, scopeLine: 53, thisAdjustment: 1, isOptimized: false, unit: !0)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !34}
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "MetaType<main.Atomic<i64>>", file: !1, size: 64, align: 64, elements: !144)
!144 = !{!145, !145, !145, !145, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 8)
!146 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed_char)
!147 = !DILocalVariable(name: "self", scope: !140, file: !1, line: 53, type: !143)
!148 = !DILocation(line: 53, column: 21, scope: !140)
!149 = !DILocalVariable(name: "memoryOrder", scope: !140, file: !1, line: 53, type: !34)
!150 = !DILocation(line: 54, column: 16, scope: !140)
!151 = !DILocation(line: 62, column: 14, scope: !140)
!152 = !DILocation(line: 60, column: 79, scope: !140)
!153 = !DILocation(line: 60, column: 18, scope: !140)
!154 = !DILocation(line: 56, column: 14, scope: !140)
!155 = distinct !DISubprogram(name: "_CNW4mainE4Bool4copyES0_L0", linkageName: "_CNW4mainE4Bool4copyES0_L0", scope: !0, file: !6, line: 1, type: !98, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!156 = !DILocation(line: 1, column: 2, scope: !155)
!157 = distinct !DISubprogram(name: "_CNW4mainE4Bool14__default_initES0_L0", linkageName: "_CNW4mainE4Bool14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !98, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!158 = !DILocation(line: 1, column: 2, scope: !157)
!159 = distinct !DISubprogram(name: "_CNW4mainE4BoolC1EbL5value", linkageName: "_CNW4mainE4BoolC1EbL5value", scope: !0, file: !6, line: 1, type: !160, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!160 = !DISubroutineType(types: !161)
!161 = !{!109, !103}
!162 = !DILocation(line: 1, column: 2, scope: !159)
!163 = distinct !DISubprogram(name: "_CNW4mainE4BoolC2ERS0_bL0L5value", linkageName: "_CNW4mainE4BoolC2ERS0_bL0L5value", scope: !0, file: !6, line: 1, type: !160, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!164 = !DILocation(line: 1, column: 2, scope: !163)
!165 = distinct !DISubprogram(name: "_CNW4mainE4BoolD3Ev", linkageName: "_CNW4mainE4BoolD3Ev", scope: null, file: !6, line: 1, type: !107, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!166 = !DILocation(line: 1, column: 2, scope: !165)
!167 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD0Ev", linkageName: "_CNW4mainE17ValueWitnessTableD0Ev", scope: !0, file: !6, line: 1, type: !168, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!168 = !DISubroutineType(types: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !171, size: 64, align: 8)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ValueWitnessTable", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !172)
!172 = !{!173, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "copyFn", scope: !171, file: !6, line: 1, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 8)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !171, file: !6, line: 1, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 8)
!180 = !DISubroutineType(types: !181)
!181 = !{!177}
!182 = !DILocation(line: 1, column: 2, scope: !167)
!183 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", linkageName: "_CNW4mainE17ValueWitnessTable14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !184, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!184 = !DISubroutineType(types: !185)
!185 = !{!171}
!186 = !DILocation(line: 1, column: 2, scope: !183)
!187 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC1EDoFvPvKPvEDoFvS1_EL6copyFnL6deinit", scope: !0, file: !6, line: 1, type: !188, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!188 = !DISubroutineType(types: !189)
!189 = !{!170, !174, !179}
!190 = !DILocation(line: 1, column: 2, scope: !187)
!191 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", linkageName: "_CNW4mainE17ValueWitnessTableC2ERS0_DoFvPvKPvEDoFvS2_EL0L6copyFnL6deinit", scope: !0, file: !6, line: 1, type: !188, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!192 = !DILocation(line: 1, column: 2, scope: !191)
!193 = distinct !DISubprogram(name: "_CNW4mainE17ValueWitnessTableD3Ev", linkageName: "_CNW4mainE17ValueWitnessTableD3Ev", scope: null, file: !6, line: 1, type: !168, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!194 = !DILocation(line: 1, column: 2, scope: !193)
!195 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD0Ev", linkageName: "_CNW4mainE19ProtocolConformanceD0Ev", scope: !0, file: !6, line: 1, type: !196, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!196 = !DISubroutineType(types: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !199, size: 64, align: 8)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ProtocolConformance", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !200)
!200 = !{!201, !220}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !199, file: !6, line: 1, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 8)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.TypeInfo", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !204)
!204 = !{!205, !206, !208, !209, !212, !214, !216, !218, !219}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "baseClass", scope: !203, file: !6, line: 1, baseType: !202, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !203, file: !6, line: 1, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !203, file: !6, line: 1, baseType: !179, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !6, line: 1, baseType: !210, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 8)
!211 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned_char)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "valueWitnessTable", scope: !203, file: !6, line: 1, baseType: !213, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "conformances", scope: !203, file: !6, line: 1, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 8)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !6, line: 1, baseType: !217, size: 64, align: 64, offset: 384)
!217 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !203, file: !6, line: 1, baseType: !217, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !203, file: !6, line: 1, baseType: !217, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !199, file: !6, line: 1, baseType: !207, size: 64, align: 64, offset: 64)
!221 = !DILocation(line: 1, column: 2, scope: !195)
!222 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", linkageName: "_CNW4mainE19ProtocolConformance14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !223, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!223 = !DISubroutineType(types: !224)
!224 = !{!199}
!225 = !DILocation(line: 1, column: 2, scope: !222)
!226 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC1EKPNS_8TypeInfoEKPKPvL8typeInfoL6vtable", scope: !0, file: !6, line: 1, type: !227, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!227 = !DISubroutineType(types: !228)
!228 = !{!198, !202, !207}
!229 = !DILocation(line: 1, column: 2, scope: !226)
!230 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", linkageName: "_CNW4mainE19ProtocolConformanceC2ERS0_KPNS_8TypeInfoEKPKPvL0L8typeInfoL6vtable", scope: !0, file: !6, line: 1, type: !227, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!231 = !DILocation(line: 1, column: 2, scope: !230)
!232 = distinct !DISubprogram(name: "_CNW4mainE19ProtocolConformanceD3Ev", linkageName: "_CNW4mainE19ProtocolConformanceD3Ev", scope: null, file: !6, line: 1, type: !196, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!233 = !DILocation(line: 1, column: 2, scope: !232)
!234 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD0Ev", linkageName: "_CNW4mainE8TypeInfoD0Ev", scope: !0, file: !6, line: 1, type: !235, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!235 = !DISubroutineType(types: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !203, size: 64, align: 8)
!238 = !DILocation(line: 1, column: 2, scope: !234)
!239 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfo14__default_initES0_L0", linkageName: "_CNW4mainE8TypeInfo14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !240, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!240 = !DISubroutineType(types: !241)
!241 = !{!203}
!242 = !DILocation(line: 1, column: 2, scope: !239)
!243 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC1EKPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 1, type: !244, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!244 = !DISubroutineType(types: !245)
!245 = !{!237, !202, !207, !179, !210, !213, !215, !217, !217, !217}
!246 = !DILocation(line: 1, column: 2, scope: !243)
!247 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", linkageName: "_CNW4mainE8TypeInfoC2ERS0_KPS0_KPKPvDoFvPvEKPhKPNS_17ValueWitnessTableEKPNS_19ProtocolConformanceEmmmL0L9baseClassL6vtableL6deinitL4nameL17valueWitnessTableL12conformancesL4sizeL9alignmentL6stride", scope: !0, file: !6, line: 1, type: !244, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!248 = !DILocation(line: 1, column: 2, scope: !247)
!249 = distinct !DISubprogram(name: "_CNW4mainE8TypeInfoD3Ev", linkageName: "_CNW4mainE8TypeInfoD3Ev", scope: null, file: !6, line: 1, type: !235, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!250 = !DILocation(line: 1, column: 2, scope: !249)
!251 = distinct !DISubprogram(name: "_CNW4mainE5Int64D0Ev", linkageName: "_CNW4mainE5Int64D0Ev", scope: !0, file: !6, line: 1, type: !252, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!252 = !DISubroutineType(types: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !255, size: 64, align: 8)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.Int64", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !255, file: !6, line: 1, baseType: !14, size: 64, align: 64)
!258 = !DILocation(line: 1, column: 2, scope: !251)
!259 = distinct !DISubprogram(name: "_CNW4mainE5Int644copyES0_L0", linkageName: "_CNW4mainE5Int644copyES0_L0", scope: !0, file: !6, line: 1, type: !260, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!260 = !DISubroutineType(types: !261)
!261 = !{!255}
!262 = !DILocation(line: 1, column: 2, scope: !259)
!263 = distinct !DISubprogram(name: "_CNW4mainE5Int6414__default_initES0_L0", linkageName: "_CNW4mainE5Int6414__default_initES0_L0", scope: !0, file: !6, line: 1, type: !260, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!264 = !DILocation(line: 1, column: 2, scope: !263)
!265 = distinct !DISubprogram(name: "_CNW4mainE5Int64C1ElL5value", linkageName: "_CNW4mainE5Int64C1ElL5value", scope: !0, file: !6, line: 1, type: !266, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!266 = !DISubroutineType(types: !267)
!267 = !{!254, !14}
!268 = !DILocation(line: 1, column: 2, scope: !265)
!269 = distinct !DISubprogram(name: "_CNW4mainE5Int64C2ERS0_lL0L5value", linkageName: "_CNW4mainE5Int64C2ERS0_lL0L5value", scope: !0, file: !6, line: 1, type: !266, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!270 = !DILocation(line: 1, column: 2, scope: !269)
!271 = distinct !DISubprogram(name: "_CNW4mainE5Int64D3Ev", linkageName: "_CNW4mainE5Int64D3Ev", scope: null, file: !6, line: 1, type: !252, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!272 = !DILocation(line: 1, column: 2, scope: !271)
!273 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD0Ev", linkageName: "_CNW4mainE20ExistentialContainerD0Ev", scope: !0, file: !6, line: 1, type: !274, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!274 = !DISubroutineType(types: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !277, size: 64, align: 8)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "main.<private name>.ExistentialContainer", file: !6, line: 1, flags: DIFlagFwdDecl, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !6, line: 1, baseType: !177, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "typeInfo", scope: !277, file: !6, line: 1, baseType: !202, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "conformance", scope: !277, file: !6, line: 1, baseType: !215, size: 64, align: 64, offset: 128)
!282 = !DILocation(line: 1, column: 2, scope: !273)
!283 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", linkageName: "_CNW4mainE20ExistentialContainer14__default_initES0_L0", scope: !0, file: !6, line: 1, type: !284, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!284 = !DISubroutineType(types: !285)
!285 = !{!277}
!286 = !DILocation(line: 1, column: 2, scope: !283)
!287 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC1EPvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 1, type: !288, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!288 = !DISubroutineType(types: !289)
!289 = !{!276, !177, !202, !215}
!290 = !DILocation(line: 1, column: 2, scope: !287)
!291 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", linkageName: "_CNW4mainE20ExistentialContainerC2ERS0_PvKPNS_8TypeInfoEKPNS_19ProtocolConformanceEL0L5valueL8typeInfoL11conformance", scope: !0, file: !6, line: 1, type: !288, isLocal: false, isDefinition: true, scopeLine: 1, thisAdjustment: 1, isOptimized: false, unit: !0)
!292 = !DILocation(line: 1, column: 2, scope: !291)
!293 = distinct !DISubprogram(name: "_CNW4mainE20ExistentialContainerD3Ev", linkageName: "_CNW4mainE20ExistentialContainerD3Ev", scope: null, file: !6, line: 1, type: !274, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!294 = !DILocation(line: 1, column: 2, scope: !293)
